def area(a, b):
    '''
    Возвращает площадь прямоугольника по длинам двух его смежных сторон.

        Параметры:
            a (float | int): длина первой стороны (ширина)
            b (float | int): длина второй стороны (длина)

        Возвращаемое значение:
            float | int: площадь прямоугольника (S = a * b)

        Пример вызова:
            >>> area(3, 4)
            12
    '''
    return a * b


def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника по длинам двух его смежных сторон.

        Параметры:
            a (float | int): длина первой стороны (ширина)
            b (float | int): длина второй стороны (длина)

        Возвращаемое значение:
            float | int: периметр прямоугольника (P = 2 * (a + b))

        Пример вызова:
            >>> perimeter(3, 4)
            14
    '''
    return 2 * (a + b)
