def area(a):
    '''
    Возвращает площадь квадрата по длине его стороны.

        Параметры:
            a (float | int): длина стороны квадрата

        Возвращаемое значение:
            float | int: площадь квадрата (S = a²)

        Пример вызова:
            >>> area(5)
            25
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата по длине его стороны.

        Параметры:
            a (float | int): длина стороны квадрата

        Возвращаемое значение:
            float | int: периметр квадрата (P = 4 * a)

        Пример вызова:
            >>> perimeter(5)
            20
    '''
    return 4 * a
