def area(a, h):
    '''
    Возвращает площадь треугольника по длине стороны и высоте, опущенной на эту сторону.

        Параметры:
            a (float | int): длина основания (стороны треугольника)
            h (float | int): высота, проведённая к стороне a

        Возвращаемое значение:
            float: площадь треугольника (S = (a * h) / 2)

        Пример вызова:
            >>> area(6, 4)
            12.0
    '''
    return a * h / 2


def perimeter(a, b, c):
    '''
    Возвращает периметр треугольника по длинам трёх его сторон.

        Параметры:
            a (float | int): длина первой стороны
            b (float | int): длина второй стороны
            c (float | int): длина третьей стороны

        Возвращаемое значение:
            float | int: периметр треугольника (P = a + b + c)

        Пример вызова:
            >>> perimeter(3, 4, 5)
            12
    '''
    return a + b + c
